/*
1. Задать температуру в градусах по Цельсию. 
Вывести в alert соответствующую температуру в градусах по Фаренгейту. Подсказка: расчёт идёт по формуле: Tf = (9 / 5) * Tc + 32, 
где Tf – температура по Фаренгейту, Tc – температура по Цельсию
*/
let Tc = prompt("Введите температуру в Цельсиях:");
if( !isNaN(Tc)){
    let Tf = (9/5)*Tc + 32;
    alert(`Температура в Фаренгейтах - ${Tf}`);
}else{
    alert("Введите число!");
}

/*
  3. Объявить две переменные: admin и name. Записать в name строку "Василий";
   Скопировать21 значение из name в admin. Вывести admin (должно вывести «Василий»).
 */

let admin;
let name = "Василий";

admin = name;

alert(admin);

/*
 4. *Чему будет равно JS-выражение 1000 + "108"
 */

 let num = 1000 + "108"; //1000108
 alert(num);

 /*
 5. *Самостоятельно 
 разобраться с атрибутами тега script (async и defer)
 */

//  Разобрался :)